DROP DATABASE IF EXISTS `test`;

CREATE DATABASE `test`
CHARACTER SET utf8
COLLATE utf8_general_ci;

USE `test`;

DROP TABLE IF EXISTS `note`;

CREATE TABLE `note`(
  `id` INT NOT NULL AUTO_INCREMENT,
  `title` VARCHAR(100) NOT NULL,
  `text` VARCHAR(255) NOT NULL,
  `createdDate` DATETIME NOT NULL DEFAULT NOW(),
  `done` BOOLEAN NOT NULL DEFAULT FALSE,
  PRIMARY KEY (`id`)
);

INSERT INTO `note`(`title`, `text`, `done`, `createdDate`)
VALUES ('Погладить', 'Брюки, рубашку, футболку', false, '2018-02-18 00:50:33'),
  ('Авто', 'Заменить свечи', false, '2018-02-01 00:50:33'),
  ('Цветы', 'Полить фуксии', false, '2018-02-02 00:50:33'),
  ('Ксерокопия', 'Паспорт, полис', false, '2018-02-05 00:50:33'),
  ('Дирекция', 'Проставить пропуски', false, '2018-02-02 00:40:33'),
  ('Почта', 'Забрать посылку до субботы', false, '2018-01-10 00:23:33'),
  ('Купить', 'Хлеб, молоко, масло', false, '2018-01-10 00:50:33'),
  ('Написать', 'Пару заметок для наполнения сайта', false, '2018-02-18 00:50:33'),
  ('Елка', 'Наконец-то разобрать и выбросить', false, '2018-02-18 00:50:33'),
  ('Пропылесосить', 'В том числе в машине', false, '2018-01-18 00:50:22'),
  ('Пароварка', 'Закинуть гречку в 22:00', false, '2018-01-21 00:50:12'),
  ('Позвонить', 'Перенести заказ в интернет-магазине', false, '2017-12-12 00:50:45'),
  ('Футболка', 'Поставить ставку', false, '2018-02-11 00:50:23'),
  ('Aliexpress', 'Посмотреть аккумулятор', false, '2018-02-12 00:50:09'),
  ('JavaRush', 'Попасть на стажировку', true, '2018-02-22 23:59:19'),
  ('Резюме', 'Написать резюме', false, '2018-02-13 00:50:13'),
  ('Второе дыхание', 'Осталось еще чуть-чуть', false, '2018-02-14 00:50:16'),
  ('Постирать', 'Белую рубашку и джинсы', false, '2018-02-15 00:50:33'),
  ('Почистить', 'Разобрать и удалить старые фото на флешке', false, '2016-02-18 00:50:33'),
  ('Проверить', 'HDD на битые сектора', false, '2018-02-17 00:50:33'),
  ('Подвернуть', 'Штаны', true, '2017-06-18 00:12:33');